[
    {
        "qns": "Welcome to Roomieville, where the quest for the perfect roommate awaits! As you embark on your journey, you must select the top few traits most important to you:\n Imagine standing before the Great Wall of Roomie Criteria, adorned with scrolls representing communication, boundaries, financial responsibilities, compromise, ownership, cleanliness, similar interests, reliability, adaptability, vice usage, pets, and quiet hours.\n With only a few scrolls to guide you, which traits will you prioritize? Choose wisely, for your selection will shape the course of your roommate quest in Roomieville!",
        "type": 3
    },
    {
        "qns": "Welcome back to Roomieville! Now that you've chosen your top few traits, let's delve deeper into your preferences by considering the less important traits.\n Picture yourself once again standing before the Great Wall of Roomie Criteria, adorned with scrolls representing communication, boundaries, financial responsibilities, compromise, ownership, cleanliness, similar interests, reliability, adaptability, vice usage, pets, and quiet hours.\n While some traits took precedence in your selection, others may not hold as much weight. Which of these traits will you deem less important in your ideal roommate? Consider carefully, as this decision will still influence the harmony of your living situation in Roomieville!",
        "type": 3
    },
    {
        "qns": "In the grand arena of 'Domestic Harmony: The Quest for Peace,' you're faced with the inevitable dragon of disagreement. As a valiant inhabitant of this shared castle, your approach to battling this beast is crucial for maintaining the peace within the kingdom's walls. On the scale of strategic combat, where 1 is retreating to your tower to devise a plan (needing time to process before discussing), 5 is summoning the council for a treaty (seeking a compromise), and 10 is drawing your sword to address the dragon head-on (addressing it directly), how do you rate your preferred method of engagement? Choose wisely, brave soul, for your strategy informs the tales of harmony (or discord) sung by the minstrels.",
        "type": 1
    },
    {
        "qns": "In the bustling village of Roomieville, where shared spaces and personal nooks coexist, you're tasked with drafting the Roomie Code—a guide that balances alone time with social gatherings, and personal chores with shared duties. On a scale from 1 to 10, where 1 suggests these rules are more like loose guidelines (not important at all) and 10 means they're the heart and soul of Roomieville's peace (extremely important), how crucial do you think setting these boundaries is for a harmonious co-living experience? Your rating will carve the path to understanding and respect among all villagers.",
        "type": 1
    },
    {
        "qns": "In the enchanted land of Roomiemore, where the treasures of financial responsibility gleam, you're faced with a crucial decision at the Crossroads of Coin. True or false: You believe in the magic of diligent management of monthly expenses such as rent and utilities as the key to prosperity in Roomiemore. Choose wisely, for your answer will determine whether the gates to the vaults of fiscal harmony swing open wide or remain firmly shut.",
        "type": 0
    },{
        "qns": "You've landed in the classic roommate conundrum: You're a lover of serene, quiet evenings, but your roommate is the social butterfly of the year, wanting to host the social event of the week, every week, in your shared space. With the stage set for an epic showdown of preferences, how do you script the next scene? How do you navigate this lively plot twist to pen a compromise that gets a thumbs-up from both critics?",
        "type": 2
    },
    {
        "qns": "In the latest episode of 'Roomies: The Shared Saga,' you find yourself at a crossroads over the communal cloak of Comfort—a.k.a. your favorite super-soft blanket. Your roommate, drawn to its allure, sees it as a shared treasure, while you view it as a personal relic not up for the communal draft. With the lines of personal items and shared booty blurred, how do you set the scene for a dialogue about the map of boundaries and expectations? Spin us the tale of how you navigate these treacherous waters, marking X on what's solely yours and what's for the crew.",
        "type": 2
    },
    {
        "qns": "In the next thrilling chapter of 'The Chronicles of Cleanliness: Shared Spaces Edition,' you're the hero(ine) tasked with maintaining the harmony of the kingdom—er, apartment—through the magic of tidiness. As you wield your enchanted broom and dustpan, how do you ensure the dragons of disorder and the goblins of grime don't overrun the common realms of Kitchenland and Living Roomania? Describe your mystical rituals of cleanliness that keep the peace, and how you enlist the aid of your fellow knight-roommate in this noble quest. What are the sacred scrolls (a.k.a. cleaning standards) you both swear to uphold for the good of the realm?",
        "type": 2
    },
    {
        "qns": "In the bustling town of Roomieville, where each door holds a world of possibilities, you find yourself at the threshold of companionship. As you envision the adventures that await within your shared abode, you ponder the tapestry of interests that could weave between you and your potential roommate. Picture this: You're sitting at the cozy hearth, chatting with your prospective cohabitant. The fire crackles merrily as you share tales of your passions and hobbies. Are there any pursuits close to your heart that you dream of sharing with a kindred spirit? Or perhaps you're eager to embark on a journey of exploration, open to new experiences and discoveries. Paint us a picture of the shared adventures that await in the halls of Roomieville.",
        "type": 2
    },
    {
        "qns": "In the mystical land of Roomieville, where adventures and mishaps await around every corner, you find yourself amidst tales of reliance and camaraderie. True or false: Have you ever embarked on a daring quest, relying on a roommate to be your trusty sidekick in times of need, or have they turned to you as the valiant hero in their hour of peril? ",
        "type": 0
    },
    {
        "qns": "Welcome to Roomietopia, where surprises abound and flexibility reigns supreme. Imagine waking up to unexpected guests, a shift in shared responsibilities, and schedules in flux.\nOn a scale of 1 to 10, how adept are you at adapting to these changes? Are you a steadfast rock or a flexible reed in the winds of change? Your numerical response will reveal your adaptability in Roomietopia!",
        "type": 1
    },
    {
        "qns": "In the whimsical realm of Petopia, where furry friends frolic and feathers fly, you find yourself amidst a menagerie of magical creatures. Picture this: you awaken one morning to the delightful chirping of a dragon hatchling nestled in its cozy nest by the window, while a mischievous unicorn foal prances around the room, leaving a trail of glitter in its wake. As you bask in the warmth of their companionship, you contemplate your preferences and any fears that may lurk in the shadows of this enchanted land.\n On a scale of 1 to 10, where 1 is as timid as a mouse and 10 is as bold as a lion, how do you rate your readiness to embrace the whimsical wonders of Petopia? Are you eager to cuddle with creatures great and small, or do you find yourself trembling at the mere thought of a playful puppy or a curious kitten? Cast your numerical spell and let us discover the depths of your affinity for the magical creatures that roam the lands of Petopia!",
        "type": 1
    },
    {
        "qns": "Welcome to Chillville, where peaceful evenings reign supreme. As the sun sets, the apartment transforms into a sanctuary of serenity.\n What are your expectations for quiet hours on weekdays and weekends?",
        "type": 1
    },
    {
        "qns": "In the enchanted castle of Roomiehaven, where laughter echoes through the halls and secrets linger in the air, you stand at the threshold of lifestyle choices and harmony. True or false: What say you on the presence of elixirs and enchanted potions like alcohol, tobacco, or other substances within the hallowed walls of our abode? ",
        "type": 0
    }
]